#include "site.h"

/*
起点 青羊宫 杜甫草堂 机会 武侯祠 双流机场 命运 放屁税 宽窄巷子 牢狱
成都欢乐谷 四川大学 春熙路 机会熊猫基地 免费停车场
都江堰 九眼桥 命运 东郊记忆 打嗝税 成都东火车站 机会 青城山 进牢
海洋公园 西南民族大学 建设路 命运 太古里
*/
vector<string> site::names = { "起点","青羊宫","杜甫草堂","机会","武侯祠","双流机场","命运","放屁税","宽窄巷子","牢狱",
							"成都欢乐谷", "四川大学", "春熙路", "机会","熊猫基地", "免费停车场",
							"都江堰","九眼桥","命运","东郊记忆","打嗝税","成都东火车站","机会","青城山","进牢",
							"海洋公园","西南民族大学","建设路","命运","太古里" };
vector<int> site::xs = {1100,950,850,740,630,510,400,300,180,50 ,
						50 ,50 ,50 ,50 ,50 , 50,
						200,300,400,520,630,740,850,950,1100,
						1100,1100,1100,1100,1100 };
vector<int> site::ys = { 650,650,650,650,650, 650,650,650,650,650,
							520,430,350,250,150,30,
							30 ,30 ,30 , 30, 30, 30, 30, 30, 30,
							150,250,350,430,520 };
vector<int> site::prices = { 0,4000,1600,0,1000,2000,0,-700,2000,0,
							  2200,1200,2400,0,2600,0,
							  2200,3000,0,2400,-700,2000,0,3200,0,
							  3200,1200,3400,0,4000 };