#include "destiny.h"

vector<vector<string>> destiny::contents = { 
									{"rua小孩子噶堆，被判猥亵，送入监狱，并罚款300元",
									"买草莓多多奶茶，花去100元",
									"吃九宫格火锅，花去300元",
									"你被评为“年度好噶堆”，获得奖金600元",
									"打响嗝比赛中获得第二名，获得奖金500元",
									"买泡泡玛特，花去100元",
									"泡泡玛特开出超级稀有款，竞拍卖出获得800元",
									"双11买byt花去200元",
									"收到快递着火短信，被诈骗200元",
									"写的人物通讯获得稿费300元",
									"微博抽奖获得200元",
									"饭卡弄丢损失100元"} ,
									{"惹对象生气，花费200元买两个泡泡玛特哄ta",
									"购买战袍花费100元",
									"戒指戴错手指，罚款1000元！",
									"不想起床，花费100元找代课",
									"篮球课被球砸脸，支付医药费500元",
									"遇到圣诞老人，获得100元的糖果礼物",
									"做漂亮便当，把厨房弄爆炸，罚款1500元",
									"用番茄酱做出极品美味，被全球美食爱好者追捧，申请为专利卖出获得3000元！",
									"上完厕所发现一枚戒指，忍着恶臭戴上后出现戒神，奖励了你1000元",
									"在朋友圈发布自拍后，被养猪场工作人员当作出逃的猪猪强行带回，后经调解获补偿1000元",
									"淘宝买家秀穿搭获高赞，卖家奖励你100元小红包",
									"被朋友看到和对象的聊天记录，把朋友秀吐血，赔偿医药费500元"} 
								};
vector<vector<int>> destiny::money_changes = { {-300,-100,-300,600,500,-100,800,-200,-200,300,200,-100},
												{-200,-100,-1000,-100,-500,100,-1500,3000,1000,1000,100,-500} };



destiny::destiny(int m_kind)
{
	//对于错误输入，将kind设为0
	if (m_kind >= money_changes.size())
		kind = 0;
	else 
		kind = m_kind;
	
	//获得随机id
	static default_random_engine e(time(0));
	static uniform_int_distribution<int> u(0,contents[kind].size()-1);
	id = u(e);
}

